## SQL Join 概述

*Prepare data*

In [3]:
%load_ext sql
%config SqlMagic.autocommit=True
%sql mssql+pyodbc://sa:Lily870104@MSSQLTest

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
%%sql use test1;
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [18]:
%%sql drop table orders;
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [19]:
%%sql create table orders(
    order_id int primary key,
    emp_id int,
    order_date date
    );
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [20]:
%%sql insert into orders(order_id, emp_id, order_date) values(1, 104, '2016-04-18'),
    (2, 1002, '2016-04-18'),
    (3, 1005, '2016-04-19'),
    (4, 1001, '2016-04-20'),
    (5, null, '2016-05-01');
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
5 rows affected.
Done.

[]

In [9]:
%sql select * from orders;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1, 104, datetime.date(2016, 4, 18)),
 (2, 102, datetime.date(2016, 4, 18)),
 (3, 105, datetime.date(2016, 4, 19)),
 (4, 101, datetime.date(2016, 4, 20)),
 (5, None, datetime.date(2016, 5, 1))]

*自己join自己，叫self-join*

In [12]:
%%sql select t2.first_name as employee,
    t1.first_name as manager
    from 
    employee t1 join employee t2
    on
    t1.emp_id = t2.mgr_id;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('Scott', 'Allen'),
 ('Martin', 'Allen'),
 ('John', 'Arun'),
 ('Nithya', 'Allen'),
 ('Smith', 'Nithya'),
 ('Miller', 'Allen')]

*inner join的例子*

In [21]:
%%sql select employee.emp_id, orders.order_id, orders.order_date
    from employee
    inner join orders
    on employee.emp_id = orders.emp_id
    order by 
    employee.emp_id;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 4, datetime.date(2016, 4, 20)),
 (1002, 2, datetime.date(2016, 4, 18)),
 (1005, 3, datetime.date(2016, 4, 19))]

In [22]:
%sql select * from employee;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 'Allen', 'Finch', None, None, None, 'J7', 10, None),
 (1002, 'Scott', 'Tigger', 1001, None, None, 'J2', 10, None),
 (1003, 'Martin', 'Blake', 1001, None, None, 'J3', 10, None),
 (1004, 'Arun', 'Turner', None, None, datetime.date(2008, 6, 5), 'J4', 20, Decimal('40000.0000')),
 (1005, 'John', 'Root', 1004, None, datetime.date(2010, 1, 10), 'J5', 20, None),
 (1006, 'Nithya', 'Jones', 1001, None, datetime.date(1999, 2, 12), 'J6', 30, Decimal('500000.0000')),
 (1007, 'Smith', 'Ruth', 1006, None, datetime.date(2010, 7, 21), 'J1', 10, Decimal('30000.0000')),
 (1008, 'Miller', 'Ward', 1001, None, None, 'J8', 40, None),
 (1009, 'Alex', 'Fin', None, None, None, 'J7', 30, None)]

*另一种老式的inner join 写法也可以，但是不推荐*

In [24]:
%%sql select employee.emp_id, orders.order_id, orders.order_date
    from employee, orders
    where employee.emp_id = orders.emp_id
    order by
    employee.emp_id;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 4, datetime.date(2016, 4, 20)),
 (1002, 2, datetime.date(2016, 4, 18)),
 (1005, 3, datetime.date(2016, 4, 19))]

*如果要用table alias的话，查询语句的所有地方都需要用table alias*

In [26]:
%%sql select e.emp_id, o.order_id, o.order_date 
    from 
    employee as e
    inner join
    orders as o
    on e.emp_id = o.emp_id
    order by e.emp_id;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 4, datetime.date(2016, 4, 20)),
 (1002, 2, datetime.date(2016, 4, 18)),
 (1005, 3, datetime.date(2016, 4, 19))]

*self - join的时候，必须要指定table alias,否则会翻车* <br>
*self-join的例子*

In [29]:
%%sql select e1.emp_id, e2.last_name, e2.first_name
    from employee as e1
    inner join employee as e2
    on e1.emp_id = e2.emp_id
    order by 
    e1.emp_id;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 'Finch', 'Allen'),
 (1002, 'Tigger', 'Scott'),
 (1003, 'Blake', 'Martin'),
 (1004, 'Turner', 'Arun'),
 (1005, 'Root', 'John'),
 (1006, 'Jones', 'Nithya'),
 (1007, 'Ruth', 'Smith'),
 (1008, 'Ward', 'Miller'),
 (1009, 'Fin', 'Alex')]

*Another inner join example*

In [30]:
%%sql select t2.first_name as first_name,
    t1.dept_name as dept_name
    from dept as t1
    inner join employee as t2
    on 
    t1.dept_no = t2.dept_no;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('Allen', 'HR'),
 ('Scott', 'HR'),
 ('Martin', 'HR'),
 ('Arun', 'Marketing'),
 ('John', 'Marketing'),
 ('Nithya', 'Sales'),
 ('Smith', 'HR'),
 ('Miller', 'Developer'),
 ('Alex', 'Sales')]

*Left outer join*

*Employee是左表，左表里面的所有数据都会被拿回来*

In [33]:
%%sql select employee.emp_id, orders.order_id, orders.order_date
    from employee
    left outer join orders
    on employee.emp_id = orders.emp_id
    order by
    employee.emp_id;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 4, datetime.date(2016, 4, 20)),
 (1002, 2, datetime.date(2016, 4, 18)),
 (1003, None, None),
 (1004, None, None),
 (1005, 3, datetime.date(2016, 4, 19)),
 (1006, None, None),
 (1007, None, None),
 (1008, None, None),
 (1009, None, None)]

*在某些数据库系统里面，left join和left outer join是一回事儿*

In [35]:
%%sql select employee.emp_id, orders.order_id, orders.order_date
    from employee
    left join orders
    on 
    employee.emp_id = orders.emp_id
    order by
    employee.emp_id;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 4, datetime.date(2016, 4, 20)),
 (1002, 2, datetime.date(2016, 4, 18)),
 (1003, None, None),
 (1004, None, None),
 (1005, 3, datetime.date(2016, 4, 19)),
 (1006, None, None),
 (1007, None, None),
 (1008, None, None),
 (1009, None, None)]

*Left outer join another example*

In [38]:
%%sql select t1.first_name as first_name,
    t2.dept_name as dept_name
    from
    employee as t1
    left outer join
    dept as t2
    on 
    t1.dept_no = t2.dept_no;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('Allen', 'HR'),
 ('Scott', 'HR'),
 ('Martin', 'HR'),
 ('Arun', 'Marketing'),
 ('John', 'Marketing'),
 ('Nithya', 'Sales'),
 ('Smith', 'HR'),
 ('Miller', 'Developer'),
 ('Alex', 'Sales')]

*Right Outer join*

*Right Outer join的例子，* <br>
*orders表中的所有记录都要被select 出来*

In [40]:
%%sql select employee.emp_id, orders.order_id, orders.order_date
    from employee
    right outer join 
    orders
    on employee.emp_id = orders.emp_id
    order by 
    employee.emp_id;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(None, 1, datetime.date(2016, 4, 18)),
 (None, 5, datetime.date(2016, 5, 1)),
 (1001, 4, datetime.date(2016, 4, 20)),
 (1002, 2, datetime.date(2016, 4, 18)),
 (1005, 3, datetime.date(2016, 4, 19))]

*通过OrderID倒排*

In [42]:
%%sql select employee.emp_id, orders.order_id, orders.order_date
    from employee
    right outer join 
    orders
    on employee.emp_id = orders.emp_id
    order by 
    orders.order_id desc;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(None, 5, datetime.date(2016, 5, 1)),
 (1001, 4, datetime.date(2016, 4, 20)),
 (1005, 3, datetime.date(2016, 4, 19)),
 (1002, 2, datetime.date(2016, 4, 18)),
 (None, 1, datetime.date(2016, 4, 18))]

*Full Outer Join* <br>
*Full outer join example*

In [45]:
%%sql select t1.first_name as first_name,
    t2.dept_name as department
    from employee as t1
    full outer join dept as t2
    on t1.dept_no = t2.dept_no;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('Allen', 'HR'),
 ('Scott', 'HR'),
 ('Martin', 'HR'),
 ('Arun', 'Marketing'),
 ('John', 'Marketing'),
 ('Nithya', 'Sales'),
 ('Smith', 'HR'),
 ('Miller', 'Developer'),
 ('Alex', 'Sales')]

In [47]:
%%sql select employee.emp_id, orders.order_id, orders.order_date
    from employee
    full outer join orders
    on 
    employee.emp_id = orders.emp_id
    order by
    employee.emp_id;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(None, 1, datetime.date(2016, 4, 18)),
 (None, 5, datetime.date(2016, 5, 1)),
 (1001, 4, datetime.date(2016, 4, 20)),
 (1002, 2, datetime.date(2016, 4, 18)),
 (1003, None, None),
 (1004, None, None),
 (1005, 3, datetime.date(2016, 4, 19)),
 (1006, None, None),
 (1007, None, None),
 (1008, None, None),
 (1009, None, None)]

* 笛卡尔积 cross join

* 1 [1, 2, 3] <br>
2 [1, 2, 3] <br>
3 [1, 2, 3] <br>

* 笛卡尔积的例子

In [48]:
%%sql select employee.emp_id, orders.order_id, orders.order_date
    from employee 
    cross join orders
    order by employee.emp_id;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 1, datetime.date(2016, 4, 18)),
 (1001, 2, datetime.date(2016, 4, 18)),
 (1001, 3, datetime.date(2016, 4, 19)),
 (1001, 4, datetime.date(2016, 4, 20)),
 (1001, 5, datetime.date(2016, 5, 1)),
 (1002, 1, datetime.date(2016, 4, 18)),
 (1002, 2, datetime.date(2016, 4, 18)),
 (1002, 3, datetime.date(2016, 4, 19)),
 (1002, 4, datetime.date(2016, 4, 20)),
 (1002, 5, datetime.date(2016, 5, 1)),
 (1003, 1, datetime.date(2016, 4, 18)),
 (1003, 2, datetime.date(2016, 4, 18)),
 (1003, 3, datetime.date(2016, 4, 19)),
 (1003, 4, datetime.date(2016, 4, 20)),
 (1003, 5, datetime.date(2016, 5, 1)),
 (1004, 1, datetime.date(2016, 4, 18)),
 (1004, 2, datetime.date(2016, 4, 18)),
 (1004, 3, datetime.date(2016, 4, 19)),
 (1004, 4, datetime.date(2016, 4, 20)),
 (1004, 5, datetime.date(2016, 5, 1)),
 (1005, 1, datetime.date(2016, 4, 18)),
 (1005, 2, datetime.date(2016, 4, 18)),
 (1005, 3, datetime.date(2016, 4, 19)),
 (1005, 4, datetime.date(2016, 4, 20)),
 (1005, 5, datetime.date(2016, 5, 1)),
 (1006, 1, datetime.date(2016, 4, 18)),
 (1006, 2, datetime.date(2016, 4, 18)),
 (1006, 3, datetime.date(2016, 4, 19)),
 (1006, 4, datetime.date(2016, 4, 20)),
 (1006, 5, datetime.date(2016, 5, 1)),
 (1007, 1, datetime.date(2016, 4, 18)),
 (1007, 2, datetime.date(2016, 4, 18)),
 (1007, 3, datetime.date(2016, 4, 19)),
 (1007, 4, datetime.date(2016, 4, 20)),
 (1007, 5, datetime.date(2016, 5, 1)),
 (1008, 1, datetime.date(2016, 4, 18)),
 (1008, 2, datetime.date(2016, 4, 18)),
 (1008, 3, datetime.date(2016, 4, 19)),
 (1008, 4, datetime.date(2016, 4, 20)),
 (1008, 5, datetime.date(2016, 5, 1)),
 (1009, 1, datetime.date(2016, 4, 18)),
 (1009, 2, datetime.date(2016, 4, 18)),
 (1009, 3, datetime.date(2016, 4, 19)),
 (1009, 4, datetime.date(2016, 4, 20)),
 (1009, 5, datetime.date(2016, 5, 1))]

* another cross join example

In [49]:
%%sql select t1.dept_name as department,
    t2.first_name as first_name
    from dept as t1
    cross join
    employee as t2;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('HR', 'Allen'),
 ('HR', 'Scott'),
 ('HR', 'Martin'),
 ('HR', 'Arun'),
 ('HR', 'John'),
 ('HR', 'Nithya'),
 ('HR', 'Smith'),
 ('HR', 'Miller'),
 ('HR', 'Alex'),
 ('Marketing', 'Allen'),
 ('Marketing', 'Scott'),
 ('Marketing', 'Martin'),
 ('Marketing', 'Arun'),
 ('Marketing', 'John'),
 ('Marketing', 'Nithya'),
 ('Marketing', 'Smith'),
 ('Marketing', 'Miller'),
 ('Marketing', 'Alex'),
 ('Sales', 'Allen'),
 ('Sales', 'Scott'),
 ('Sales', 'Martin'),
 ('Sales', 'Arun'),
 ('Sales', 'John'),
 ('Sales', 'Nithya'),
 ('Sales', 'Smith'),
 ('Sales', 'Miller'),
 ('Sales', 'Alex'),
 ('Developer', 'Allen'),
 ('Developer', 'Scott'),
 ('Developer', 'Martin'),
 ('Developer', 'Arun'),
 ('Developer', 'John'),
 ('Developer', 'Nithya'),
 ('Developer', 'Smith'),
 ('Developer', 'Miller'),
 ('Developer', 'Alex')]

* join的时候也可以添加filter 条件

In [52]:
%%sql select employee.emp_id, orders.order_id, orders.order_date
    from employee
    inner join orders
    on employee.emp_id = orders.emp_id
    where employee.emp_id > 1002
    order by
    employee.emp_id;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1005, 3, datetime.date(2016, 4, 19))]

* join的时候用*的话，所有的两个表的columns都会出来

In [53]:
%%sql select *
    from employee
    inner join orders
    on employee.emp_id = orders.emp_id
    where employee.emp_id > 1002
    order by
    employee.emp_id;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1005, 'John', 'Root', 1004, None, datetime.date(2010, 1, 10), 'J5', 20, None, 3, 1005, datetime.date(2016, 4, 19))]

* 有主从关系 [primary key 和 foreign key的]，可以join，
* 没有主从关系，只要有相同的列的，也可以join

## Great Job!